RobertParker1764/SAMD21_Libraries/SAMD21_TC_Library/SAMD21TC_Library.cpp

//SAMD21G18 Timer/Counter (TC) Peripheral Driver
//Version 1.0
//March 10, 2019
//By Robert Parker

/*
 Copyright (c) 2019 Robert Parker. All right reserved.
 
 This library is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation; either
 version 2.1 of the License, or (at your option) any later version.
 
 This library is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 Lesser General Public License for more details.
 
 You should have received a copy of the GNU Lesser General Public
 License along with this library; if not, write to the Free Software
 Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
 */

//See user notes in file SAMD21G18_TC_Driver.h

#include <SAMD21TC_Library.h>
#include "wiring_private.h"

namespace SAMD21TC {
    
    
    /******************** Static Class Member Initialization *****************************/
    
    //This array will hold pointers to the TC class objects (e.g. TC8Bit) that are
    //instantiated. The array is managed by the three static factory methods (get8BitTC,
    //etc.). Initially no TC instances are allocated so the array if filled with nullptr.
    TCBaseClass * TCBaseClass::allocatedTC[3] = {nullptr, nullptr, nullptr};
    
    /******************** Static Member Function Definition ******************************/
    
    //=====================================================================================
    //get8BitTC()
    //User interface to allocate new 8-bit timer/counter driver objects. All 8-bit timer/
    //counter objects should be instantiated using this method to ensure valid objects are
    //created.
    //Parameters:
    //  timerNumber:  _TC3, _TC4, or _TC5
    //Return:   A pointer to the newly created obect or nullptr if an object could
    //          not be created. User should ALWAYS check for nullptr to make sure
    //          a valid object was created before trying to use it.
    //=====================================================================================
    
    TC8Bit * TCBaseClass::get8BitTC(timerInstance_t timerNumber)
    {
        TC8Bit * timer;
        
        //Make sure the requested timer instance is available (not already allocated)
        //Can only allocate one timer object for each instance
        if (allocatedTC[timerNumber]) {
            return nullptr;
        }
        
        //Instantiate the requested timer/counter instance, mark the timer number as used
        //and return a pointer to the timer/counter instance
        timer = new TC8Bit(timerNumber);
        allocatedTC[timerNumber] = timer;
        
        return timer;
    }
    
    //=====================================================================================
    //get16BitTC()
    //User interface to allocate new 16-bit timer/counter driver objects. All 16-bit timer/
    //counter objects should be instantiated using this method to ensure valid objects are
    //created.
    //Parameters:
    //  timerNumber:  _TC3, _TC4, or _TC5
    //Return:   A pointer to the newly created obect or nullptr if an object could
    //          not be created. User should ALWAYS check for nullptr to make sure
    //          a valid object was created before trying to use it.
    //=====================================================================================
    
    TC16Bit * TCBaseClass::get16BitTC(timerInstance_t timerNumber)
    {
        TC16Bit * timer;
        
        //Make sure the requested timer is available (not already allocated)
        //Can only allocate one timer object for each instance
        if (allocatedTC[timerNumber]) {
            return nullptr;
        }
        
        //Instantiate the requested timer/counter instance, mark the timer number as used
        //and return a pointer to the timer/counter instance
        timer = new TC16Bit(timerNumber);
        allocatedTC[timerNumber] = timer;
        
        return timer;
    }
    
    //=====================================================================================
    //get32BitTC()
    //User interface to allocate new 32-bit timer/counter driver object. All 32-bit timer/
    //counter objects should be instantiated using this method to ensure valid objects are
    //created. The SAMD21G18 only supports one 32-bit timer/counter at a time and it uses
    //the TC4 and TC3 TC instances.
    //Parameters:
    //  timerNumber:  _TC4 is the only valid TC instance for 32-bit timer/counters
    //Return:   A pointer to the newly created obect or nullptr if an object could
    //          not be created. User should ALWAYS check for nullptr to make sure
    //          a valid object was created before trying to use it.
    //=====================================================================================
    
    TC32Bit * TCBaseClass::get32BitTC(timerInstance_t timerNumber)
    {
        TC32Bit * timer;
        
        //First check to make sure the requested timer is available (not already allocated
        //and make sure the requested timer size is compatible with the requested
        //timer number.
        //Can only allocate one timer object for each instance
        if (allocatedTC[timerNumber]) {
            return nullptr;
        }
        
        //32-bit timers are only allowed on TC4
        if (timerNumber == _TC3 || timerNumber == _TC5) {
            return nullptr;
        }
        
        //32-bit timers require two TC instances (TC3/TC4) to be free
        if (allocatedTC[_TC3]) {
            return nullptr;
        }
        
        //Instantiate the requested timer/counter instance, mark the timer number as used
        //and return a pointer to the timer/counter instance
        timer = new TC32Bit(timerNumber);
        allocatedTC[timerNumber] = timer;
        allocatedTC[timerNumber - 1] = timer;
        
