RobertParker1764/SAMD21_Libraries/SAMD21_TC_Library/SAMD21TC_Library.cpp
        return timer;
    }
    

    //=====================================================================================
    //deleteTC()
    //User interface to delete an allocated counter/timer driver object. All timer/counter
    //objects should be deleted using this method when they are no longer needed, to free
    //memory and ensure a new driver object can be instantiated later if needed.
    //Parameters:
    //  timerNumber:  _TC3, _TC4, or _TC5
    //Return:   None
    //=====================================================================================
    void TCBaseClass::deleteTC(timerInstance_t timerNumber)
    {
        //Need to query the timer object to see if it is a 32-bit timer
        if (allocatedTC[timerNumber]->mSize == _32BIT) {
            delete allocatedTC[timerNumber];
            allocatedTC[timerNumber] = nullptr;
            allocatedTC[timerNumber + 1] = nullptr;
        } else {
            delete allocatedTC[timerNumber];
            allocatedTC[timerNumber] = nullptr;
        }
    }
    
    //Interrupt Handler
    //=====================================================================================
    //tcInterruptHandler()
    //Forwards an interrupt request to the appropriate TC instance
    //Parameters:
    //  timerNumber:  _TC3, _TC4, or _TC5
    //Return:   None
    //=====================================================================================
    void TCBaseClass::tcInterruptHandler(uint8_t tcNumber)
    {
        if (allocatedTC[tcNumber]) {
            allocatedTC[tcNumber]->handleInterrupt();
        }
    }
    //=========================================================================================
    //******************* TCBaseClass Member Function Definitions *****************************
    //=========================================================================================
    
    //Class Constructor
    //=====================================================================================
    //TCBaseClass()
    //Instantiates a new TCBaseClass object. This class is only used as a base class for
    //the other classes. This constructor should never be called by the user.
    //Parameters:
    //  timerNumber:  _TC3, _TC4, or _TC5
    //Return:   None
    //=====================================================================================
    TCBaseClass::TCBaseClass(timerInstance_t timerNumber)
    {
        //Create a temporary array of register stack pointers
        Tc *const tc_modules[] = TC_INSTS;       //TC_INSTS defined as {TC3, TC4, TC5}
        pRegisterBaseAddress = tc_modules[timerNumber];
        
        instance = timerNumber;
        
        //Initialize the array of callback function pointers to all nullptr
        for (int index = 0; index < 6; index++) {
            callBackFuncPtrs[index] = nullptr;
        }
        
        //Enable the user interface clock for this instance in the power manager
        //Temporary array of APBC Mask register constants (defined in pm.h)
        uint32_t inst_pm_apbmask[] = {PM_APBCMASK_TC3, PM_APBCMASK_TC4, PM_APBCMASK_TC5};
        /* Enable the user interface clock in the PM */
        PM->APBCMASK.reg |= inst_pm_apbmask[timerNumber];
    }
    
    //=====================================================================================
    //enableTC()
    //Enables operation of the SAMD21 hardware timer counter instance. Sets the ENABLE bit
    //in control register A.
    //Parameters: None
    //Return: None
    //=====================================================================================
    void TCBaseClass::enableTC()
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CTRLA.reg |= TC_CTRLA_ENABLE;
        
    }
    
    //=====================================================================================
    //disableTC()
    //Disables operation of the SAMD21 hardware timer counter instance. Clears the ENABLE
    //bit in control register A.
    //Parameters: None
    //Return: None
    //=====================================================================================
    void TCBaseClass::disableTC()
    {
        //TODO: Need to disable interrupts here
        
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CTRLA.reg &= ~TC_CTRLA_ENABLE;
    }
    
    //=====================================================================================
    //resetTC()
    //Issues a software reset to the SAMD21 hardware timer instance. Resets all TC
    //registers (except DBGCTRL) to their initial state. The TC will be disabled.
    //Parameters: None
    //Return: None
    //=====================================================================================
    void TCBaseClass::resetTC()
    {
        disableTC();
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CTRLA.reg = 0x1;   //Set the SWRST bit
        //Block until software reset is complete (SWRST bit is cleared)
        while (pRegisterBaseAddress->COUNT8.CTRLA.bit.SWRST == 1);
    }
    
    //=====================================================================================
    //retriggerTC()
    //Issues the RETRIGGER command to the SAMD21 hardware timer instance. Effects the CMD
    //bits in Control Register B
    //Parameters: None
    //Return: None
    //=====================================================================================
    void TCBaseClass::retriggerTC()
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CTRLBSET.reg = RETRIGGER_COMMAND;
    }
    
    //=====================================================================================
    //stopTC()
    //Issues the STOP command to the SAMD21 hardware timer instance. Effects the CMD
    //bits in Control Register B
    //Parameters: None
    //Return: None
    //=====================================================================================
    void TCBaseClass::stopTC()
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CTRLBSET.reg = STOP_COMMAND;
    }
    
    //=====================================================================================
    //isStopped()
    //Tests if the SAMD21 hardware timer instance is stopped.
    //Parameters: None
    //Return:   True if the timer is stopped. False othewise
    //=====================================================================================
    bool TCBaseClass::isStopped() const
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        return (pRegisterBaseAddress->COUNT8.STATUS.bit.STOP == 1);
    }
    
    //=====================================================================================
    //setCountDirection()
    //Sets the SAMD21 hardware timer instance count direction to count-up or count-down.
    //Changes the DIR bit in Control Register B.
    //Parameters:
    //  direction: COUNT_UP or COUNT_DOWN
    //Return: None
    //=====================================================================================
    void TCBaseClass::setCountDirection(countDirection_t direction)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        if (direction == COUNT_UP) {
            pRegisterBaseAddress->COUNT8.CTRLBCLR.reg = TC_CTRLBCLR_DIR;
        } else {
            pRegisterBaseAddress->COUNT8.CTRLBSET.reg = TC_CTRLBSET_DIR;
        }
    }
    
    //=====================================================================================
    //configureTimer()
    //This is the primary method used to configure the TC hardware instance before use in
    //counter/compare operations as described in the SAMD21 data sheet.
    //Configures the timer for basic timer operation. The timer may or may not (default)
    //be enabled when this method completes. The user must separately set TOP (PER or CCO),
    //compare channel 0/1 values, and enable interrupts if this functionality is desired.
    //Parameters:
    //  clockDivision: A valid clockPrescaler_t value (e.g. DIVIDE_BY_1)
    //  waveGenerationMode: NORMAL_FREQUENCY, MATCH_FREQUENCY, NORMAL_PWM, or MATCH_PWM
    //  waveformOutput0Pin: Default is 0 - not output pin assigned. Other valid values are
    //                      TC3: 2/10  TC4: A1/20  TC5: 10
    //  waveformOutput1Pin: Default is 0 - no output pin assigned. Other valid values are
    //                      TC3: 5/12  TC4: A2/21  TC5: 11
    //  enable: If true (default) the timer counter instance will be enabled, it will remain
    //          disabled otherwise
    //  prescalerSyncMode: GENERIC_CLOCK (defalut), PRESCALER_CLOCK, or
    //                     GENERIC_CLOCK_RESET_PRESCALER
    //  countDirection: COUNT_UP (defalult) or COUNT_DOWN
    //  invertOutputx: If false (default) the outputs will not be inverted, if true then
    //                 the outputs will be inverted
    //  runStandby: If false (default) then the timer will not run in standby, if true then
    //              the timer will run in standby.
    //  oneShotTimer: If false (default) the timer will not operate in one-shot mode. If true
    //                it will operate in one-shot mode.
    //Return: False if invalid pin numbers were supplied, True otherwise
    //=====================================================================================
    bool TCBaseClass::configureTimer(clockPrescaler_t clockDivision,
                                     waveGeneration_t waveGenerationMode,
                                     uint8_t waveformOutput0Pin,
                                     uint8_t waveformOutput1Pin,
                                     bool enable,
                                     reloadResetMode_t prescalerSyncMode,
                                     countDirection_t countDirection,
                                     bool invertOutput0,
                                     bool invertOutput1,
                                     bool runStandby,
                                     bool oneShotTimer)
    {
        //Disable the timer before starting configuration
        disableTC();
    
