RobertParker1764/SAMD21_Libraries/SAMD21_TC_Library/SAMD21TC_Library.cpp
        //Compute the value for control register A
        uint16_t tempCtrlA = clockDivision | waveGenerationMode | prescalerSyncMode;
        if (mSize == _8BIT) {
            tempCtrlA |= TC_CTRLA_MODE_COUNT8;
        } else if (mSize == _16BIT) {
            tempCtrlA |= TC_CTRLA_MODE_COUNT16;
        } else {
            tempCtrlA |= TC_CTRLA_MODE_COUNT32;
        }
        if (runStandby) {
            tempCtrlA |= TC_CTRLA_RUNSTDBY;
        }
        
        //Block until synchronization is complete then write register CTRLA
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CTRLA.reg = tempCtrlA;
        
        //Modify control register B if needed
        uint8_t tempCtrlReg = 0;
        if (countDirection || oneShotTimer) {
            if (countDirection) {
                tempCtrlReg |= TC_CTRLBSET_DIR;
            }
            if (oneShotTimer) {
                tempCtrlReg |= TC_CTRLBSET_ONESHOT;
            }
            
            //Block until synchronization is complete then write register CTRLB
            while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
            pRegisterBaseAddress->COUNT8.CTRLBSET.reg = tempCtrlReg;
        }
        
        //Modify control register C if needed
        if (invertOutput0 || invertOutput1) {
            tempCtrlReg = 0;
            if (invertOutput0) {
                tempCtrlReg |= TC_CTRLC_INVEN0;
            }
            if (invertOutput1) {
                tempCtrlReg |= TC_CTRLC_INVEN1;
            }
            
            //Block until synchronization is complete then write register CTRLC
            while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
            pRegisterBaseAddress->COUNT8.CTRLC.reg = tempCtrlReg;
        }
        
        //Enable the waveform output pins if used
        //Channel 0
        if (waveformOutput0Pin) {
            if (pRegisterBaseAddress == TC3) {
                if (waveformOutput0Pin == 2) {
                    pinPeripheral(waveformOutput0Pin, (EPioType)MUX_PA14E_TC3_WO0);
                } else if (waveformOutput0Pin == 10) {
                    pinPeripheral(waveformOutput0Pin, (EPioType)MUX_PA18E_TC3_WO0);
                } else {
                    //Invalid pin
                    return false;
                }
            } else if (pRegisterBaseAddress == TC4) {
                if (waveformOutput0Pin == 20) {
                    pinPeripheral(waveformOutput0Pin, (EPioType)MUX_PA22E_TC4_WO0);
                } else if (waveformOutput0Pin == A1) {
                    pinPeripheral(waveformOutput0Pin, (EPioType)MUX_PB08E_TC4_WO0);
                } else {
                    //Invalid pin
                    return false;
                }
            } else {        //TC5
                if (waveformOutput0Pin == MOSI) {
                    pinPeripheral(waveformOutput0Pin, (EPioType)MUX_PB10E_TC5_WO0);
                } else {
                    //Invalid pin
                    return false;
                }
            }
        }
        
        //Channel 1
        if (waveformOutput1Pin) {
            if (pRegisterBaseAddress == TC3) {
                if (waveformOutput1Pin == 5) {
                    pinPeripheral(waveformOutput1Pin, (EPioType)MUX_PA15E_TC3_WO1);
                } else if (waveformOutput1Pin == 12) {
                    pinPeripheral(waveformOutput1Pin, (EPioType)MUX_PA19E_TC3_WO1);
                } else {
                    //Invalid pin
                    return false;
                }
            } else if (pRegisterBaseAddress == TC4) {
                if (waveformOutput1Pin == 21) {
                    pinPeripheral(waveformOutput1Pin, (EPioType)MUX_PA23E_TC4_WO1);
                } else if (waveformOutput1Pin == A2) {
                    pinPeripheral(waveformOutput1Pin, (EPioType)MUX_PB09E_TC4_WO1);
                } else {
                    //Invalid piin
                    return false;
                }
            } else {        //TC5
                if (waveformOutput1Pin == SCK) {
                    pinPeripheral(waveformOutput1Pin, (EPioType)MUX_PB11E_TC5_WO1);
                } else {
                    //Invalid pin
                    return false;
                }
            }
        }
        
        
        
        if (enable) {
            enableTC();
        }
        
        return true;
    }
    
    bool TCBaseClass::configureCaptureOperation()
    {
        //TODO: Implement configureCounter()
        return false;
    }
    
    //=====================================================================================
    //handleInterrupt()
    //Examines the interrupt flag register (INTFLAG) and handles any enabled interrupts
    //by calling the associated user provided callback functions.
    //Parameters: None
    //Return: None
    //=====================================================================================
    void TCBaseClass::handleInterrupt()
    {
        //Retrieve the interrupt flag state
        uint8_t interruptFlags = pRegisterBaseAddress->COUNT8.INTFLAG.reg;
        //Clear the INTFLAG register
        pRegisterBaseAddress->COUNT8.INTFLAG.reg = INTFLAG_CLEAR;
        
        
        //For each set interrupt flag check for a callback function (enabled interrupts
        //will always have a callback function) and call it if it exists
        uint8_t index = 0;
        uint8_t flag = 0x01;
        while (interruptFlags) {
            if (index == 2) {
                index++;
                flag <<= 1;
                continue;
            }
            
            if ((interruptFlags & flag) && callBackFuncPtrs[index]) {
                //Call the interrupt callback function
                callBackFuncPtrs[index]();
            }
            
            //Clear the flag that we just examined
            interruptFlags &= ~flag;
            
            //Increment for next loop
            flag <<= 1;
            index++;
            
