RobertParker1764/SAMD21_Libraries/SAMD21_TC_Library/SAMD21TC_Library.cpp
        }
        
    }
    
    //=====================================================================================
    //enableInterrupt()
    //Enables the specified interrupt and registers the callback function for later use.
    //Parameters:
    //  interruptName:  The interrupt type (e.g. TC_OVERFLOW)
    //  callbackFunc:   Pointer to the interrupt callback function
    //Return: None
    //=====================================================================================
    void TCBaseClass::enableInterrupt(tcInterrupt_t interuptName, void(* callbackFunc)(void))
    {
        //Save the callback function pointer
        switch (interuptName) {
            case TC_OVERFLOW:
                callBackFuncPtrs[0] = callbackFunc;
                break;
            case TC_ERROR:
                callBackFuncPtrs[1] = callbackFunc;
                break;
            case TC_SYNCRDY:
                callBackFuncPtrs[3] = callbackFunc;
                break;
            case TC_CHANNEL_0_MATCH:
                callBackFuncPtrs[4] = callbackFunc;
                break;
            case TC_CHANNEL_1_MATCH:
                callBackFuncPtrs[5] = callbackFunc;
                
        }
        
        //Enable timer interrupts in the Nested Vector Interrupt Controller (NVIC)
        //The elements of IRQNumbers[] (TC3_IRQn, etc) are defined in the file samd21g18a.h
        //Reference Table 11-3 in the SAMD21G user manual/data sheet. The
        //NVIC_ClearPendingIRQ() and NVIC_EnableIRQ() are inline functions provided
        //via the Atmel CMSIS software and are contained in file core_cm0plus.h
        IRQn_Type IRQNumbers[] = { TC3_IRQn, TC4_IRQn, TC5_IRQn };
        //Clear any pending interrupts for the associated IRQ Number
        NVIC_ClearPendingIRQ(IRQNumbers[instance]);
        //Enable interrupts for the associated IRQ Number
        NVIC_EnableIRQ(IRQNumbers[instance]);
        
        /* Enable TC interrupt */
        pRegisterBaseAddress->COUNT8.INTENSET.reg = interuptName;
    }
    
    //=====================================================================================
    //disableInterrupt()
    //Disables the specified interrupt and clears the registered callback function.
    //Parameters:
    //  interruptName:  The interrupt type (e.g. TC_OVERFLOW)
    //Return: None
    //=====================================================================================
    void TCBaseClass::disableInterrupt(tcInterrupt_t interuptName)
    {
        //Disable the indicated interrupt
        pRegisterBaseAddress->COUNT8.INTENCLR.reg = interuptName;
        
        //Set the corresponding callback function to nullptr
        switch (interuptName) {
            case TC_OVERFLOW:
                callBackFuncPtrs[0] = nullptr;
                break;
            case TC_ERROR:
                callBackFuncPtrs[1] = nullptr;
                break;
            case TC_SYNCRDY:
                callBackFuncPtrs[3] = nullptr;
                break;
            case TC_CHANNEL_0_MATCH:
                callBackFuncPtrs[4] = nullptr;
                break;
            case TC_CHANNEL_1_MATCH:
                callBackFuncPtrs[5] = nullptr;
                break;
                
        }
    }
    
    //=====================================================================================
    //setControlRegisterA()
    //Sets the value of control register A (CTRLA) to the specified value
    //Parameters:
    //  value: The value to be loaded into control register A
    //Return: None
    //=====================================================================================
    void TCBaseClass::setControlRegisterA(uint16_t value)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CTRLA.reg = value;
    }
    
    //=====================================================================================
    //getControlRegisterA()
    //Returns the current value of control register A (CTRLA)
    //Parameters: None
    //Return: Current value of control register A
    //=====================================================================================
    uint16_t TCBaseClass::getControlRegisterA(void)
    {
        return pRegisterBaseAddress->COUNT8.CTRLA.reg;
    }
    
    //=====================================================================================
    //setOneShotMode()
    //Sets the TC instance in oneShot or continuous mode depending on the value of oneShot
    //Parameters:
    //  oneShot: If true the TC instance is put in oneShot mode. If false the TC instance
    //           is put in continuous count mode
    //Return: None
    //=====================================================================================
    void TCBaseClass::setOneShotMode(bool oneShot)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        if (oneShot) {
            pRegisterBaseAddress->COUNT8.CTRLBSET.reg = TC_CTRLBSET_ONESHOT;
        } else {
            pRegisterBaseAddress->COUNT8.CTRLBCLR.reg = TC_CTRLBCLR_ONESHOT;
        }
    }
    
    
    //=====================================================================================
    //getControlRegisterB()
    //Returns the current value of control register B (CTRLB)
    //Parameters: None
    //Return: Current value of control register B
    //=====================================================================================
    uint8_t TCBaseClass::getControlRegisterB()
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        return pRegisterBaseAddress->COUNT8.CTRLBSET.reg;
    }
    
    
    //=====================================================================================
    //getInterruptEnableState()
    //Returns the current value of the Interrupt Enable Clear register (INTENCLR)
    //Parameters: None
    //Return: Current value of INTENCLR register
    //=====================================================================================
    uint8_t TCBaseClass::getInterruptEnableState()
    {
        return pRegisterBaseAddress->COUNT8.INTENCLR.reg & INTFLAG_CLEAR;
    }
    
    //=====================================================================================
    //getInterruptFlags()
    //Returns the current value of the Interrupt Flag Status and Clear register (INTFLAG)
    //Parameters: None
    //Return: Current value of INTFLAG register
    //=====================================================================================
    uint8_t TCBaseClass::getInterruptFlags()
    {
        return pRegisterBaseAddress->COUNT8.INTFLAG.reg & INTFLAG_CLEAR;
    }
    
    
    //=====================================================================================
    //clearInterruptFlags()
    //Clears the interrupt flags passed in flags
    //Parameters:
    //  flags:  A value specifying one or more interrupt flags to clear. Valid values are
    //          TC_OVERFLOW, TC_ERROR, TC_SYNCRDY, TC_CHANNEL_0_MATCH, TC_CHANNEL_1_MATCH,
    //          or any combination of these
    //Return: None
    //=====================================================================================
    void TCBaseClass::clearInterruptFlags(uint8_t flags)
    {
        pRegisterBaseAddress->COUNT8.INTFLAG.reg = flags;
    }
    
    //=========================================================================================
    //******************** TC8Bit Member Function Definitions *********************************
    //=========================================================================================
    
    //Class Constructor
    //=====================================================================================
    //TC8Bit()
    //The constructor is called by the factory method get8BitTC(). The user should never
    //directly call this constructor.
    //Parameters:
    //  timerNumber:    _TC3, _TC4, or _TC5
    //Return: A pointer to the TC8Bit object
    //=====================================================================================
    TC8Bit::TC8Bit(timerInstance_t timerNumber) : TCBaseClass(timerNumber)
    {
        mSize = _8BIT;
        
