RobertParker1764/SAMD21_Libraries/SAMD21_TC_Library/SAMD21TC_Library.cpp
    }
    
    //=====================================================================================
    //setPeriod()
    //Sets the SAMD21 hardware timer instance PER register value.
    //Changes the PER register.
    //Parameters:
    //  period: new 8-bit value to be loaded into PER register
    //Return: None
    //=====================================================================================
    void TC8Bit::setPeriod(uint8_t period)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.PER.reg = period;
    }
    
    //=====================================================================================
    //getPeriod()
    //Returns the SAMD21 hardware timer instance PER register contents.
    //Parameters: None
    //Return: PER register 8-bit value
    //=====================================================================================
    uint8_t TC8Bit::getPeriod() const
    {
        return pRegisterBaseAddress->COUNT8.PER.reg;
    }
    
    //=====================================================================================
    //setCompareChannel0()
    //Sets the SAMD21 hardware timer instance CC0 register value.
    //Changes the CC0 register.
    //Parameters:
    //  compareValue: new 8-bit value to be loaded into CC0 register
    //Return: None
    //=====================================================================================
    void TC8Bit::setCompareChannel0(uint8_t compareValue)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CC[0].reg = compareValue;
    }
    
    //=====================================================================================
    //getCompareChannel0()
    //Returns the SAMD21 hardware timer instance CC0 register contents.
    //Parameters: None
    //Return: CC0 register 8-bit value
    //=====================================================================================
    uint8_t TC8Bit::getCompareChannel0() const
    {
        return pRegisterBaseAddress->COUNT8.CC[0].reg;
    }
    
    //=====================================================================================
    //setCompareChannel1()
    //Sets the SAMD21 hardware timer instance CC1 register value.
    //Changes the CC1 register.
    //Parameters:
    //  compareValue: new 8-bit value to be loaded into CC1 register
    //Return: None
    //=====================================================================================
    void TC8Bit::setCompareChannel1(uint8_t compareValue)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.CC[1].reg = compareValue;
    }
    
    //=====================================================================================
    //getCompareChannel1()
    //Returns the SAMD21 hardware timer instance CC1 register contents.
    //Parameters: None
    //Return: CC1 register 8-bit value
    //=====================================================================================
    uint8_t TC8Bit::getCompareChannel1() const
    {
        return pRegisterBaseAddress->COUNT8.CC[1].reg;
    }
    
    //=====================================================================================
    //setCount()
    //Sets the SAMD21 hardware timer instance COUNT register value.
    //Changes the COUNT register.
    //Parameters:
    //  count: new 8-bit value to be loaded into COUNT register
    //Return: None
    //=====================================================================================
    void TC8Bit::setCount(uint8_t count)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT8.COUNT.reg = count;
    }
    
    //=====================================================================================
    //getCount()
    //Returns the SAMD21 hardware timer instance COUNT register contents.
    //Parameters: None
    //Return: COUNT register 8-bit value
    //=====================================================================================
    uint8_t TC8Bit::getCount() const
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        return pRegisterBaseAddress->COUNT8.COUNT.reg;
    }
    
    //=========================================================================================
    //******************** TC16Bit Member Function Definitions *********************************
    //=========================================================================================
    
    //Class Constructor
    //=====================================================================================
    //TC16Bit()
    //The constructor is called by the factory method get16BitTC(). The user should never
    //directly call this constructor.
    //Parameters:
    //  timerNumber:    _TC3, _TC4, or _TC5
    //Return: A pointer to the TC16Bit object
    //=====================================================================================
    TC16Bit::TC16Bit(timerInstance_t timerNumber) : TCBaseClass(timerNumber)
    {
        mSize = _16BIT;
        
    }
    
    //=====================================================================================
    //setCompareChannel0()
    //Sets the SAMD21 hardware timer instance CC0 register value.
    //Changes the CC0 register.
    //Parameters:
    //  compareValue: new 16-bit value to be loaded into CC0 register
    //Return: None
    //=====================================================================================
    void TC16Bit::setCompareChannel0(uint16_t compareValue)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT16.CC[0].reg = compareValue;
    }
    
    //=====================================================================================
    //getCompareChannel0()
    //Returns the SAMD21 hardware timer instance CC0 register contents.
    //Parameters: None
    //Return: CC0 register 16-bit value
    //=====================================================================================
    uint16_t TC16Bit::getCompareChannel0() const
    {
        return pRegisterBaseAddress->COUNT16.CC[0].reg;
    }
    
    //=====================================================================================
    //setCompareChannel1()
    //Sets the SAMD21 hardware timer instance CC1 register value.
    //Changes the CC1 register.
    //Parameters:
    //  compareValue: new 16-bit value to be loaded into CC1 register
    //Return: None
    //=====================================================================================
    void TC16Bit::setCompareChannel1(uint16_t compareValue)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT16.CC[1].reg = compareValue;
    }
    
    //=====================================================================================
    //getCompareChannel1()
    //Returns the SAMD21 hardware timer instance CC1 register contents.
    //Parameters: None
    //Return: CC0 register 16-bit value
    //=====================================================================================
    uint16_t TC16Bit::getCompareChannel1() const
    {
        return pRegisterBaseAddress->COUNT16.CC[1].reg;
    }
    
    //=====================================================================================
    //setCount()
    //Sets the SAMD21 hardware timer instance COUNT register value.
    //Changes the COUNT register.
    //Parameters:
    //  count: new 16-bit value to be loaded into COUNT register
    //Return: None
    //=====================================================================================
    void TC16Bit::setCount(uint16_t count)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT16.COUNT.reg = count;
    }
    
    //=====================================================================================
    //getCount()
    //Returns the SAMD21 hardware timer instance COUNT register contents.
    //Parameters: None
    //Return: COUNT register 16-bit value
    //=====================================================================================
    uint16_t TC16Bit::getCount() const
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        return pRegisterBaseAddress->COUNT16.COUNT.reg;
    }
    
    //=========================================================================================
    //******************** TC32Bit Member Function Definitions *********************************
    //=========================================================================================
    
    //Class Constructor
    //=====================================================================================
    //TC32Bit()
    //The constructor is called by the factory method get32BitTC(). The user should never
    //directly call this constructor.
    //Parameters:
    //  timerNumber:    _TC4 is the only valid value
    //Return: A pointer to the TC32Bit object
    //=====================================================================================
    TC32Bit::TC32Bit(timerInstance_t timerNumber) : TCBaseClass(timerNumber)
    {
        mSize = _32BIT;
        
        
        //Enable the user interface clock for the slave counter/timer instance
        //in the power manager. It can only be the TC4 instance
        PM->APBCMASK.reg |= PM_APBCMASK_TC4;
        
