RobertParker1764/SAMD21_Libraries/SAMD21_TC_Library/SAMD21TC_Library.cpp
    }
    
    //=====================================================================================
    //setCompareChannel0()
    //Sets the SAMD21 hardware timer instance CC0 register value.
    //Changes the CC0 register.
    //Parameters:
    //  compareValue: new 32-bit value to be loaded into CC0 register
    //Return: None
    //=====================================================================================
    void TC32Bit::setCompareChannel0(uint32_t compareValue)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT32.CC[0].reg = compareValue;
    }
    
    //=====================================================================================
    //getCompareChannel0()
    //Returns the SAMD21 hardware timer instance CC0 register contents.
    //Parameters: None
    //Return: CC0 register 32-bit value
    //=====================================================================================
    uint32_t TC32Bit::getCompareChannel0() const
    {
        return pRegisterBaseAddress->COUNT32.CC[0].reg;
    }
    
    //=====================================================================================
    //setCompareChannel1()
    //Sets the SAMD21 hardware timer instance CC1 register value.
    //Changes the CC1 register.
    //Parameters:
    //  compareValue: new 32-bit value to be loaded into CC1 register
    //Return: None
    //=====================================================================================
    void TC32Bit::setCompareChannel1(uint32_t compareValue)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT32.CC[1].reg = compareValue;
    }
    
    //=====================================================================================
    //getCompareChannel1()
    //Returns the SAMD21 hardware timer instance CC1 register contents.
    //Parameters: None
    //Return: CC1 register 32-bit value
    //=====================================================================================
    uint32_t TC32Bit::getCompareChannel1() const
    {
        return pRegisterBaseAddress->COUNT32.CC[1].reg;
    }
    
    //=====================================================================================
    //setCount()
    //Sets the SAMD21 hardware timer instance COUNT register value.
    //Changes the COUNT register.
    //Parameters:
    //  count: new 32-bit value to be loaded into COUNT register
    //Return: None
    //=====================================================================================
    void TC32Bit::setCount(uint32_t count)
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        pRegisterBaseAddress->COUNT32.COUNT.reg = count;
    }
    
    //=====================================================================================
    //getCount()
    //Returns the SAMD21 hardware timer instance COUNT register contents.
    //Parameters: None
    //Return: COUNT register 32-bit value
    //=====================================================================================
    uint32_t TC32Bit::getCount() const
    {
        //Block until syncronization is complete
        while(pRegisterBaseAddress->COUNT8.STATUS.bit.SYNCBUSY == 1);
        return pRegisterBaseAddress->COUNT32.COUNT.reg;
    }
    

    
} //End SAMD21TC namespace
